namespace KantanMitsumori.Helper.Constant
{
    public static class MessageJapan
    {
        public static Dictionary<String, String> Japan = new Dictionary<string, string>()
        {
            // Information message
            { "I0002", "処理実行が成功しました。" },
            { "I0003", "マスタデータが最新版となっています。" },
            //
            { "I1000", "ユーザー情報更新が成功しました。" },
            { "I1002", "ユーザー情報の取得処理が成功しました。" },           

            // Error information message
            { "SMAL-040S", "パラメータが誤りました。" },
            { "SMAL-041D", "権限はありません。"},
            { "SMAL-020P", "タイムアウトしました。\n再度ログインしてください。" },
            { "SMAL-021C", "ユーザー名がありません。" },
            { "GCMF-020D", "ユーザー名またはパスワードが正しくありません。" },
            // ErrMsg1
            { "CEST-050S", "エラーが発生しました。" },
            { "CEST-051D", "エラーが発生しました。" },
            { "SMAI-023D", "エラーが発生しました。" },
            { "SMAI-013D", "エラーが発生しました。" },
            { "SMAI-014D", "エラーが発生しました。" },
            { "SMAI-000S", "エラーが発生しました。" },
            { "SMAI-000D", "エラーが発生しました。" },
            // ErrMsg2
            { "SMAI-020P", "ユーザー情報が確認できませんでした。" },
            { "SSLE-010P", "ユーザー情報が確認できませんでした。" },
            { "SSLE-011C", "ユーザー情報が確認できませんでした。" },
            { "SSLE-012D", "ユーザー情報が確認できませんでした。" },
            { "SSLE-013S", "ユーザー情報が確認できませんでした。" },
            { "SSLE-014S", "ユーザー情報が確認できませんでした。" },            
            { "GCMF-100D", "勤務時間調整の該当データが存在しません。" },
            { "SMAI-010D", "残業申請の該当データが存在しません。" },
            { "SMAI-028D", "残業申請の該当データが既に存在しました。" },
            // ErrMsg4
            { "SMAI-001P", "ページ遷移エラーが発生しました。<br>ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。" },
            { "SMAI-002S", "ページ遷移エラーが発生しました。<br>ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。" },
            { "SICR-001S", "ページ遷移エラーが発生しました。<br>ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。" },
            { "CEST-040D", "ページ遷移エラーが発生しました。<br>ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。" },
            { "SSLE-016P", "ページ遷移エラーが発生しました。<br>ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。" },            
            // ErrMsg2 
            { "SSLE-015P", "お客様の会員番号が確認できません。<BR>もう一度、ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。<BR><BR>　●一定時間ご利用がなかった場合、情報はクリアされます。<BR>　●「お気に入り」から直接表示した場合、会員番号が特定できません。" },
            { "SSLE-020S", "お客様の会員番号が確認できません。<BR>もう一度、ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。<BR><BR>　●一定時間ご利用がなかった場合、情報はクリアされます。<BR>　●「お気に入り」から直接表示した場合、会員番号が特定できません。" },
            { "SSLE-030S", "お客様の会員番号が確認できません。<BR>もう一度、ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。<BR><BR>　●一定時間ご利用がなかった場合、情報はクリアされます。<BR>　●「お気に入り」から直接表示した場合、会員番号が特定できません。" },
            { "SSLE-040S", "お客様の会員番号が確認できません。<BR>もう一度、ASNET/店頭商談NETの元の画面から本サービスを起動して下さい。<BR><BR>　●一定時間ご利用がなかった場合、情報はクリアされます。<BR>　●「お気に入り」から直接表示した場合、会員番号が特定できません。" },
            // Unexpected error message
            { "ISYS-010I", "エラーの発生により、操作を続けられません。" },
        };
    }
}
